InformationRegisters/ГАЛ_ИдентификаторыДляМУПуш.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>ГАЛ_ИдентификаторыДляМУПуш</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИДПодписчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИДБазыДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonForms/ГАЛ_ФормаОтправкиPush/Ext/Form/Module.bsl
&НаСервере
Процедура ОтправитьСообщениеНаСервере()
	
	
	Для Каждого ТекСтрока из Получатели Цикл
		
		  ОтправитьПушУведоплениеПодписчику(ТекСтрока.Получатель,ТексСообщения)
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщение(Команда)
	ОтправитьСообщениеНаСервере();
	ПоказатьОповещениеПользователя("Сообщение отправлено!");
КонецПроцедуры

&НаСервере
Функция ОтправитьПушУведоплениеПодписчику(ФизическоеЛицо,Сообщение) Экспорт 
		
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	                |	ГАЛ_ИдентификаторыДляМУПуш.ИДБазыДанных,
	                |	ГАЛ_ИдентификаторыДляМУПуш.ИДПодписчика
	                |ИЗ
	                |	РегистрСведений.ГАЛ_ИдентификаторыДляМУПуш КАК ГАЛ_ИдентификаторыДляМУПуш
	                |ГДЕ
	                |	ГАЛ_ИдентификаторыДляМУПуш.ФизЛицо = &ФизическоеЛицо";
	 
	 Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо); 
	 Результат = Запрос.Выполнить();
	 Выборка = Результат.Выбрать();
	 
	 Если Выборка.Количество() > 0 Тогда
		 Пока Выборка.Следующий() Цикл
			 
			 ТекИДПолучателя = ГАЛ_ВебСервисы.ГАЛ_Десериализовать(Выборка.ИДПодписчика);
			 
			 Уведомления = новый ДоставляемоеУведомление;
			 Уведомления.Получатели.Добавить(ТекИДПолучателя);
			 Уведомления.Заголовок = "Заголовок";
			 Уведомления.Текст = Сообщение;
			 Уведомления.Данные = 0; 
			 Уведомления.Наклейка = 1;
			 // Уведомления.ДатаПоявленияУниверсальноеВремя = УниверсальноеВремя(ТекущаяДата()+5);
			 		 
		 КонецЦикла;
        Попытка
		 ОтправкаДоставляемыхУведомлений.Отправить(Уведомления,Константы.ГАЛ_API_KEY_GOOGLE_PUSH.Получить()); 
		 Исключение
		//ВызватьИсключение ОписаниеОшибки();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю((ОписаниеОшибки()));
		 КонецПопытки;
		 	 
	 КонецЕсли;
 
	 	
	
КонецФункции

&НаСервере
Процедура ПодборНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	ПодборНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Документ") Тогда
		
		       
			НоваяСтрока = Получатели.Добавить();
	НоваяСтрока.Получатель = Параметры.Водитель;
	
	ТексСообщения = "Сообщение по документу: " +
	Строка( Параметры.Документ) + Символы.ПС;

		
	КонецЕсли;
КонецПроцедуры
